In [6]:
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [7]:
df = pd.read_csv("data/dataset.csv")

In [8]:
df.head(5)

,title,rating,score,vote,type,director,writter,duration,release date,release country,...,reviews,storyline,budget en $,Opening weekend USA en $,gross en $,Cumulate Worldwide Gross en $,runtime,sound Mix,Color,Aspect Ratio
0,Hababam Sinifi,9.3,xxx,38.133,Comedy; Drama,Frank Darabont,Stephen King,2h 22min,1995-03-1,USA,...,9064,Chronicles the experiences of a formerly succe...,25000000.0,727327.0,28699976.0,28817291.0,87 min,Dolby Digital,Color,1.85 : 1
1,Les Évadés,9.3,80,2.391.450,Drama,Frank Darabont,Stephen King,2h 22min,1995-03-1,USA,...,9064,Chronicles the experiences of a formerly succe...,25000000.0,727327.0,28699976.0,28817291.0,142 min,Dolby Digital,Color,1.85 : 1
2,Aynabaji,9.2,xxx,23.749,Crime; Mystery;,Frank Darabont,Stephen King,2h 22min,1995-03-1,USA,...,9064,Chronicles the experiences of a formerly succe...,25000000.0,727327.0,28699976.0,28817291.0,147 min,Dolby Digital,Color,1.85 : 1
3,Le parrain,9.2,100,1.656.870,Crime; Drama,Frank Darabont,Stephen King,2h 22min,1995-03-1,USA,...,9064,Chronicles the experiences of a formerly succe...,25000000.0,727327.0,28699976.0,28817291.0,175 min,Dolby Digital,Color,1.85 : 1
4,Soorarai Pottru,9.1,xxx,69.313,Drama,Frank Darabont,Stephen King,2h 22min,1995-03-1,USA,...,9064,Chronicles the experiences of a formerly succe...,25000000.0,727327.0,28699976.0,28817291.0,153 min,Dolby Digital,Color,1.85 : 1

In [69]:
## 1. Distribution des films par catégorie

In [10]:
data = df.set_index('type')
data.groupby('type')['title'].apply(lambda x: x)

type
Comedy; Drama                   Hababam Sinifi
Comedy; Drama      Maratonci trce pocasni krug
Comedy; Drama                 Balkanski spijun
Comedy; Drama                       Zügürt Aga
Comedy; Drama                        Marmoulak
                              ...
Drama; Mystery;                    Le Prestige
Animation; Dram        Le tombeau des lucioles
Animation; Come      Grand Prix Pignon-sur-Roc
Drama; Thriller              La Femme du sable
Horror; Mystery                       Psychose
Name: title, Length: 123, dtype: object

In [37]:
## 2. Top 50 des budgets des films
df[['budget en $', 'title']].sort_values('budget en $').head(3)

    budget en $           title
0    25000000.0  Hababam Sinifi
89   25000000.0          Wheels
88   25000000.0        Whiplash

In [ ]:
## 3. Nombre de films sortie par décennie

In [38]:
df['release date'] = pd.to_datetime(df['release date'])
data = df.set_index('release date')
data.groupby((data.index.year//10)*10).sum()

,rating,reviews,budget en $,Opening weekend USA en $,gross en $,Cumulate Worldwide Gross en $
release date,,,,,,
1990,1067.9,1114872,3.075000e+09,89461221.0,3.530097e+09,3.544527e+09

In [ ]:
## 4 Top 20 films ayant générés le plus de revenu, le moins de revenu.

In [ ]:
## 4.1. Top 20 films ayant générés le plus de revenu.

In [35]:
df[['title', 'Cumulate Worldwide Gross en $']].sort_values('Cumulate Worldwide Gross en $').head(10)

             title  Cumulate Worldwide Gross en $
0   Hababam Sinifi                     28817291.0
89          Wheels                     28817291.0
88        Whiplash                     28817291.0
87      Visaaranai                     28817291.0
86           Aruvi                     28817291.0
85    Vada Chennai                     28817291.0
84        Ratsasan                     28817291.0
83        Mahanati                     28817291.0
82        Hamilton                     28817291.0
81          Asuran                     28817291.0

In [ ]:
## 4.2. Top 20 films ayant générés le moins de revenu.

In [36]:
df[['title', 'Cumulate Worldwide Gross en $']].sort_values('Cumulate Worldwide Gross en $').tail(10)

,title,Cumulate Worldwide Gross en $
39,Neseli Günler,28817291.0
38,Monpura,28817291.0
37,Montagne II,28817291.0
36,La condition de l'homme: La prière du soldat,28817291.0
35,"Le Bon, la brute, le truand",28817291.0
34,Forrest Gump,28817291.0
33,Le Seigneur des anneaux : La Communauté de l'a...,28817291.0
32,Fight Club,28817291.0
30,Hababam Sinifi Uyaniyor,28817291.0
122,Psychose,28817291.0

In [ ]:
## 5. Analyse de la popularité des films en fonction de leurs budgets

In [33]:
data = df.set_index('budget en $')
data.groupby(by='vote', axis=0, sort=True)[['title', 'vote']].apply(lambda x: x)

                                          title       vote
budget en $
25000000.0                       Usual Suspects  1.006.925
25000000.0   Terminator 2 : Le Jugement dernier  1.010.101
25000000.0                       Les affranchis  1.041.821
25000000.0                   American History X  1.048.805
25000000.0                                 Léon  1.055.447
...                                         ...        ...
25000000.0                     Manichitrathazhu      9.186
25000000.0                                Zübük      9.353
25000000.0                               Jersey      9.803
25000000.0     Vol au-dessus d'un nid de coucou    932.770
25000000.0                        The Lion King    960.641

[123 rows x 2 columns]

In [ ]:
## 6. Distribution des revenus générés par genre de film

In [48]:
data = df.set_index('type')
data.groupby(by='type')[['title', 'gross en $']].apply(lambda x: x).head(3)

                                     title  gross en $
type
Comedy; Drama               Hababam Sinifi  28699976.0
Comedy; Drama  Maratonci trce pocasni krug  28699976.0
Comedy; Drama             Balkanski spijun  28699976.0

In [ ]:
## 7. Top 10 des films par retour sur investissement

In [49]:
df.groupby(by='gross en $', axis=0, sort=True)[['title', 'gross en $']].apply(lambda x: x).head(3)

            title  gross en $
0  Hababam Sinifi  28699976.0
1      Les Évadés  28699976.0
2        Aynabaji  28699976.0

In [ ]:
## 8. Note moyenne par année de sortie de film

In [47]:
data = df.set_index('release date')
data.groupby(by=data.index.year, axis=0, sort=True)[['title', 'gross en $']].sum()

                gross en $
release date
1995          3.530097e+09